import { useState } from "react";

export default function ToggleParagraph() {
  const [isExpanded, setIsExpanded] = useState(false);

  const toggleExpand = () => {
    setIsExpanded(!isExpanded); // Toggle the expanded state
  };

  return (
    <div className="w-full  pt-10 ">
      <div className="w-full lg:w-[75%] mx-auto py-2 lg:py-10 px-3 lg:px-0">
        <div
          className={`relative overflow-hidden transition-all duration-100 ease-in ${
            isExpanded ? "max-h-full" : "max-h-40 lg:max-h-52"
          }`}
        >
          <div className={`text-lg leading-7 text-gray-400`}>
            {/* Your long paragraph goes here */}
            <h1 className="text-gray-200">
              {" "}
              Baji বাংলাদেশ - বাংলাদেশের শীর্ষস্থানীয় অনলাইন গেমিং এবং বেটিং
              প্ল্যাটফর্ম
            </h1>
            <p className="text-sm py-3">
              বাংলাদেশে অনলাইন গেমিংয়ের জনপ্রিয়তা বৃদ্ধি পাচ্ছে, এবং যারা
              তাদের ঘরের আরাম থেকে ক্যাসিনো গেমের রোমাঞ্চ উপভোগ করতে চান, তাদের
              জন্য একটি নির্ভরযোগ্য এবং উত্তেজনাপূর্ণ অনলাইন ক্যাসিনো
              প্ল্যাটফর্ম খুঁজে পাওয়া অত্যন্ত গুরুত্বপূর্ণ হয়ে উঠেছে। আমাদের
              প্ল্যাটফর্মটি শীর্ষস্থানীয় পছন্দগুলির মধ্যে একটি হিসাবে
              দাঁড়িয়েছে, যা ইন্ডাস্ট্রির শীর্ষ গেম প্রদানকারীদের দ্বারা চালিত
              বিস্তৃত গেম এবং বেটিং বিকল্পগুলি অফার করে। আপনি যদি ক্লাসিক স্লট,
              লাইভ ডিলার গেম, বা স্পোর্টস বেটিংয়ের ভক্ত হন, আমাদের কাছে সবার
              জন্য কিছু না কিছু আছে।
            </p>
            <p className="text-base font-bold pt-8">
              শীর্ষ প্রদানকারীদের থেকে বিস্তৃত গেম নির্বাচন
            </p>
            <p className="text-sm">
              আমাদের অনলাইন ক্যাসিনোতে, আমরা আমাদের গেমগুলির বৈচিত্র্য এবং
              গুণমান নিয়ে গর্ব করি। আমরা ইন্ডাস্ট্রির কিছু সুপরিচিত গেম
              প্রদানকারীর সাথে অংশীদারিত্ব করেছি যাতে আমাদের খেলোয়াড়রা সেরা
              গেমিং অভিজ্ঞতা উপভোগ করতে পারেন। আপনি একজন অভিজ্ঞ খেলোয়াড় হন বা
              নতুন, আমাদের প্ল্যাটফর্ম এমন গেম অফার করে যা সব রকমের স্বাদ এবং
              পছন্দকে পূরণ করে।
            </p>
            <p className="pt-8 text-sm">
              আমাদের শীর্ষ প্রদানকারীদের মধ্যে রয়েছে Microgaming, যা তার
              উচ্চ-মানের স্লট এবং প্রগ্রেসিভ জ্যাকপট গেমগুলির জন্য পরিচিত। আপনি
              যদি স্পোর্টস বেটিংয়ের ভক্ত হন, SABA Sports এবং SBO Sports ফুটবল,
              ক্রিকেট, বাস্কেটবল এবং আরও অনেক কিছু সহ বেট করার জন্য বিভিন্ন
              ধরনের ক্রীড়া এবং ইভেন্ট অফার করে। যারা ইন্টারেক্টিভ এবং
              ভিজ্যুয়ালি চমকপ্রদ গেম পছন্দ করেন, তাদের জন্য Pocket Games, CQ9,
              এবং JDB বিভিন্ন স্লট গেম সরবরাহ করে যা উত্তেজনাপূর্ণ থিম এবং
              বৈশিষ্ট্যযুক্ত।
            </p>
            <p className="pt-8 text-sm">
              আমাদের প্ল্যাটফর্মটি একটি অসাধারণ লাইভ ক্যাসিনো অভিজ্ঞতা অফার করে,
              যা ইন্ডাস্ট্রি লিডার Evo এবং Big Gaming দ্বারা চালিত।
              ব্ল্যাকজ্যাক, রুলেট এবং ব্যাকারাটের মতো লাইভ ডিলার গেমগুলির
              মাধ্যমে, আপনি আপনার ঘর ছাড়াই একটি বাস্তব ক্যাসিনোর উত্তেজনা উপভোগ
              করতে পারেন। এই গেমগুলি উচ্চ-সংজ্ঞায় সম্প্রচারিত হয়, একটি
              নিমজ্জিত অভিজ্ঞতা প্রদান করে যা একটি ল্যান্ড-ভিত্তিক ক্যাসিনোর
              সাথে প্রতিযোগিতা করে।
            </p>
            <p className="pt-8 text-sm">
              কার্ড গেমের অনুরাগীদের জন্য, আমরা BPOKER, KA, এবং WM-এর মতো
              প্রদানকারীদের থেকে বিভিন্ন বিকল্প অফার করি। এছাড়াও, সাধারণ
              গেমাররা LUDO এবং So De-এর মতো সহজ কিন্তু অত্যন্ত আকর্ষণীয় গেম
              উপভোগ করতে পারেন, যা একটি দ্রুত গেমিং সেশনের জন্য উপযুক্ত।
            </p>
            <p className="text-base font-bold pt-8">
              এক্সক্লুসিভ গেম এবং উদীয়মান প্রদানকারী
            </p>
            <p className="text-sm">
              আমাদের প্ল্যাটফর্মটি উদীয়মান প্রদানকারীদের নতুন এবং উত্তেজনাপূর্ণ
              শিরোনামগুলি অন্তর্ভুক্ত করতে তার গেম লাইব্রেরি ক্রমাগত প্রসারিত
              করছে। আমরা Sexy, RT, SG, KM, JILI, P8, FC, PP, এবং PT-এর মতো
              প্রদানকারীদের এক্সক্লুসিভ গেম অফার করি। এই প্রদানকারীরা উদ্ভাবনী
              গেমপ্লে মেকানিক্স এবং অনন্য থিমগুলি নিয়ে আসে, যা আমাদের
              খেলোয়াড়দের সর্বদা নতুন কিছু অন্বেষণ করার সুযোগ দেয়। <br />
              <br /> যারা উচ্চ-মানের গ্রাফিক্স এবং নিমগ্ন গেমপ্লে খুঁজছেন তাদের
              জন্য, আমরা WorldMatch, PNG, SV388, এবং NETENT-এর শিরোনামগুলি অফার
              করি। এই প্রদানকারীরা তাদের ভিজ্যুয়ালি চমকপ্রদ গেমগুলির জন্য
              পরিচিত যা উভয় উত্তেজনা এবং উল্লেখযোগ্য পুরস্কার প্রদান করে।
              এছাড়াও, UG Sports এবং PLAYSTAR স্পোর্টস বেটিং এবং ক্যাসিনো
              গেমগুলির মিশ্রণ সরবরাহ করে, খেলোয়াড়দের জন্য যারা উভয়ের মিশ্রণ
              উপভোগ করেন। <br />
              <br /> যাতে আমাদের খেলোয়াড়রা দ্রুততম এবং সবচেয়ে উত্তেজনাপূর্ণ
              গেমগুলি অ্যাক্সেস করতে পারে, আমরা RICH88, FASTSPIN, ICF, SPRIBE,
              HotRoad এবং Yellow Bat-এর অফারগুলি অন্তর্ভুক্ত করি। এই
              প্রদানকারীরা দ্রুত-গতির গেমগুলিতে বিশেষজ্ঞ যা তাদের জন্য উপযুক্ত
              যারা দ্রুত রাউন্ড এবং তাৎক্ষণিক পুরস্কার পছন্দ করেন।
            </p>
            <p className="text-base font-bold pt-8">
              কেন আমাদের অনলাইন ক্যাসিনো বেছে নেবেন?
            </p>
            <p className="text-sm">
              বাংলাদেশে চূড়ান্ত অনলাইন গেমিং অভিজ্ঞতা প্রদান করার জন্য আমাদের
              প্ল্যাটফর্মটি ডিজাইন করা হয়েছে। আমরা নিরাপত্তা, সুরক্ষা, এবং
              ন্যায়নিষ্ঠতাকে অগ্রাধিকার দিই, নিশ্চিত করি যে আমাদের সমস্ত গেম
              লাইসেন্সপ্রাপ্ত এবং নিয়ন্ত্রিত। আমরা আপনার ব্যক্তিগত এবং আর্থিক
              তথ্য রক্ষার জন্য উন্নত এনক্রিপশন প্রযুক্তি ব্যবহার করি, যাতে আপনি
              নিশ্চিন্তে খেলতে পারেন। <br />
              <br /> আমাদের প্ল্যাটফর্মে নেভিগেট করা একটি বাতাসের মতো সহজ,
              ধন্যবাদ আমাদের ব্যবহারকারী-বান্ধব ইন্টারফেস যা আপনার প্রিয়
              গেমগুলি খুঁজে পাওয়া বা নতুনগুলি আবিষ্কার করা সহজ করে তোলে। আপনি
              একটি ডেস্কটপ বা মোবাইল ডিভাইসে খেলছেন, আমাদের প্ল্যাটফর্মটি মসৃণ
              এবং নির্বিঘ্ন গেমপ্লের জন্য অপ্টিমাইজ করা হয়েছে।
            </p>
            <p className="text-base font-bold pt-8">
              আমাদের সাথে যোগ দিন এবং পুরস্কার অর্জন করুন
            </p>
            <p className="text-sm">
              যখন আপনি আমাদের সাথে সাইন আপ করবেন, আপনি শুধুমাত্র একটি
              শীর্ষ-স্তরের অনলাইন ক্যাসিনোতে অ্যাক্সেস পাচ্ছেন না - আপনি এমন
              খেলোয়াড়দের একটি সম্প্রদায়ে যোগ দিচ্ছেন যারা এক্সক্লুসিভ বোনাস
              এবং প্রচারগুলি উপভোগ করেন। আমরা আপনার গেমিং অভিজ্ঞতা বাড়ানোর জন্য
              বিভিন্ন ধরণের পুরস্কার অফার করি, স্বাগতম বোনাস থেকে শুরু করে চলমান
              প্রচার পর্যন্ত যা আপনাকে জেতার আরও সুযোগ দেয়। অতिरिक्तভাবে,
              আমাদের রেফারেল প্রোগ্রাম আপনাকে আরও বেশি আয় করার সুযোগ দেয়।{" "}
              <br />
              <br />
              আপনার বন্ধুদের আমাদের প্ল্যাটফর্মে যোগ দিতে আমন্ত্রণ জানান, এবং
              প্রতিবার আপনার রেফার করা বন্ধুরা সাইন আপ করে এবং খেলা শুরু করে,
              আপনি একটি রেফারেল বোনাস পাবেন। এটি আপনার ব্যাংক রোল বাড়ানোর এবং
              অন্যদের সাথে উত্তেজনা ভাগ করার একটি সহজ উপায়।
            </p>
            <p className="text-base font-bold pt-8">উপসংহার</p>
            <p className="text-sm">
              বাংলাদেশে সেরা অনলাইন ক্যাসিনো অভিজ্ঞতার জন্য, আমাদের
              প্ল্যাটফর্মের চেয়ে আর কিছু দেখার প্রয়োজন নেই। Microgaming, SABA
              Sports, JDB, CQ9, Pocket Games এবং আরও অনেক শীর্ষ প্রদানকারীদের
              সাথে, আমরা প্রতিটি ধরণের খেলোয়াড়ের জন্য কিছু না কিছু অফার করি।
              আজই সাইন আপ করুন আমাদের গেমগুলি অন্বেষণ করা শুরু করতে এবং আমাদের
              উদার বোনাস এবং রেফারেল পুরস্কারের সুবিধা নিন। আপনার পরবর্তী বড়
              জয়টি মাত্র এক ক্লিক দূরে!
            </p>
            {/* Add more lines as needed */}
          </div>

          {/* Overlay when content is not expanded */}
          {!isExpanded && (
            <div className="absolute bottom-0 left-0 w-full h-6 bg-gradient-to-t from-gray-700 to-transparent blur-0 pointer-events-none"></div>
          )}
        </div>

        {/* Toggle Button */}
        <button
          style={{
            background:
              "linear-gradient(to right, #fbc103 0, #f79604 15%, #f79604 30%, #fbc103 55%, #fbc103 100%)",
          }}
          onClick={toggleExpand}
          className="mt-1 mx-auto block px-4 py-1 text-white font-semibold rounded z-[1000]"
        >
          {isExpanded ? "Show Less" : "Show More"}
        </button>
      </div>
    </div>
  );
}
